zephyrproject-rtos/hal_infineon/mtb-hal-cat1/COMPONENT_PSOC6HAL/source/cyhal_audio_common.c
/*******************************************************************************
* File Name: cyhal_audio_common.c
*
* Description:
* Provides common functionality for the I2S and TDM audio drivers.
*
********************************************************************************
* \copyright
* Copyright 2018-2021 Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include <math.h>
#include <stdlib.h>
#include <string.h> // For memset
#include "cyhal_clock.h"
#include "cyhal_gpio.h"
#include "cyhal_hw_resources.h"
#include "cyhal_hwmgr.h"
#include "cyhal_utils.h"
#include "cyhal_dma.h"
#include "cyhal_syspm.h"
#include "cy_device.h"
#include "cyhal_audio_common.h"
#include "cyhal_system.h"

#if (CYHAL_DRIVER_AVAILABLE_I2S || CYHAL_DRIVER_AVAILABLE_TDM)

#if defined(__cplusplus)
extern "C"
{
#endif

#if defined(COMPONENT_CAT2)
/* PDL register naming varies slightly between CAT1 and CAT2 */
#define REG_I2S_CTL(base)         I2S_CTL(base)
#define REG_I2S_CLOCK_CTL(base)   I2S_CLOCK_CTL(base)
#define REG_I2S_TX_CTL(base)      I2S_TX_CTL(base)
#define REG_I2S_TX_FIFO_CTL(base) I2S_TX_FIFO_CTL(base)
#else
#define _CYHAL_AUDIOSS_TX_SLAVE_AVAILABLE
#define _CYHAL_AUDIOSS_TX_WATCHDOG_AVAILABLE
#endif

#define _CYHAL_AUDIOSS_MAX_CHANNEL_LENGTH (32u)

#if defined(CY_IP_MXAUDIOSS)
static cy_rslt_t _cyhal_audioss_length_to_pdl(uint8_t user_length, cy_en_i2s_len_t *pdl_length, const _cyhal_audioss_t *obj);
static uint8_t _cyhal_audioss_length_from_pdl(cy_en_i2s_len_t pdl_length);
#define _CYHAL_AUDIOSS_FIFO_DEPTH (256)

#define _CYHAL_AUDIOSS_TX_SCK_MAP cyhal_pin_map_audioss_tx_sck
#define _CYHAL_AUDIOSS_TX_WS_MAP  cyhal_pin_map_audioss_tx_ws
#define _CYHAL_AUDIOSS_TX_SDO_MAP cyhal_pin_map_audioss_tx_sdo

#define _CYHAL_AUDIOSS_DRIVE_MODE_TX_SCK    CYHAL_PIN_MAP_DRIVE_MODE_AUDIOSS_TX_SCK
#define _CYHAL_AUDIOSS_DRIVE_MODE_TX_WS     CYHAL_PIN_MAP_DRIVE_MODE_AUDIOSS_TX_WS
#define _CYHAL_AUDIOSS_DRIVE_MODE_TX_SDO    CYHAL_PIN_MAP_DRIVE_MODE_AUDIOSS_TX_SDO

#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
#define _CYHAL_AUDIOSS_RX_SCK_MAP cyhal_pin_map_audioss_rx_sck
#define _CYHAL_AUDIOSS_RX_WS_MAP  cyhal_pin_map_audioss_rx_ws
#define _CYHAL_AUDIOSS_RX_SDI_MAP cyhal_pin_map_audioss_rx_sdi

#define _CYHAL_AUDIOSS_DRIVE_MODE_RX_SCK    CYHAL_PIN_MAP_DRIVE_MODE_AUDIOSS_RX_SCK
#define _CYHAL_AUDIOSS_DRIVE_MODE_RX_WS     CYHAL_PIN_MAP_DRIVE_MODE_AUDIOSS_RX_WS
#define _CYHAL_AUDIOSS_DRIVE_MODE_RX_SDI    CYHAL_PIN_MAP_DRIVE_MODE_AUDIOSS_RX_SDI
#endif


static I2S_Type *const _cyhal_audioss_base[] =
{
#if (CY_IP_MXAUDIOSS_INSTANCES == 1 && defined(AUDIOSS_I2S) && AUDIOSS_I2S)
    I2S,
#elif (CY_IP_MXAUDIOSS_INSTANCES >= 1 && ((defined(AUDIOSS0_I2S) && AUDIOSS0_I2S) || (defined(AUDIOSS_I2S_I2S) && AUDIOSS_I2S_I2S)))
    I2S0,
#endif
#if (CY_IP_MXAUDIOSS_INSTANCES >= 2 && defined(AUDIOSS1_I2S) && AUDIOSS1_I2S)
    I2S1,
#endif

#if (CY_IP_MXS40AUDIOSS_INSTANCES > 2)
    #warning Unhandled audioss instance count
#endif
};

#if (!defined(COMPONENT_CAT2))
#define _CYHAL_AUDIOSS_TRIGGERS_AVAILABLE
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
static const cyhal_source_t _cyhal_audioss_rx_trigger[] =
{
#if (CY_IP_MXAUDIOSS_INSTANCES == 1 && defined(AUDIOSS_I2S) && AUDIOSS_I2S)
    CYHAL_TRIGGER_AUDIOSS_TR_I2S_RX_REQ,
#elif (CY_IP_MXAUDIOSS_INSTANCES >= 1 && defined(AUDIOSS0_I2S) && AUDIOSS0_I2S)
    CYHAL_TRIGGER_AUDIOSS0_TR_I2S_RX_REQ,
#endif
#if (CY_IP_MXAUDIOSS_INSTANCES >= 2 && defined(AUDIOSS1_I2S) && AUDIOSS1_I2S)
    CYHAL_TRIGGER_AUDIOSS1_TR_I2S_RX_REQ,
#endif

#if (CY_IP_MXS40AUDIOSS_INSTANCES > 2)
    #warning Unhandled audioss instance count
#endif
};
#endif

static const cyhal_source_t _cyhal_audioss_tx_trigger[] =
{
#if (CY_IP_MXAUDIOSS_INSTANCES == 1 && defined(AUDIOSS_I2S) && AUDIOSS_I2S)
    CYHAL_TRIGGER_AUDIOSS_TR_I2S_TX_REQ,
#elif (CY_IP_MXAUDIOSS_INSTANCES >= 1 && defined(AUDIOSS0_I2S) && AUDIOSS0_I2S)
    CYHAL_TRIGGER_AUDIOSS0_TR_I2S_TX_REQ,
#endif
#if (CY_IP_MXAUDIOSS_INSTANCES >= 2 && defined(AUDIOSS1_I2S) && AUDIOSS1_I2S)
    CYHAL_TRIGGER_AUDIOSS1_TR_I2S_TX_REQ,
#endif

#if (CY_IP_MXS40AUDIOSS_INSTANCES > 2)
    #warning Unhandled audioss instance count
#endif
};
#endif

static _cyhal_audioss_t* _cyhal_audioss_config_structs[CY_IP_MXAUDIOSS_INSTANCES];

static const IRQn_Type _cyhal_audioss_irq_n[] =
{
#if (CY_IP_MXAUDIOSS_INSTANCES == 1 && (defined(AUDIOSS_I2S) && AUDIOSS_I2S || defined(AUDIOSS_I2S_I2S) && AUDIOSS_I2S_I2S)) // Without index suffix
    audioss_interrupt_i2s_IRQn,
#elif (CY_IP_MXAUDIOSS_INSTANCES >= 1 && defined(AUDIOSS0_I2S) && AUDIOSS0_I2S)
    audioss_0_interrupt_i2s_IRQn,
#endif
#if (CY_IP_MXAUDIOSS_INSTANCES >= 2 && defined(AUDIOSS1_I2S) && AUDIOSS1_I2S)
    audioss_1_interrupt_i2s_IRQn,
#endif

#if (CY_IP_MXS40AUDIOSS_INSTANCES > 2)
    #warning Unhandled audioss instance count
#endif
};

static uint8_t _cyhal_audioss_get_block_from_irqn(IRQn_Type irqn)
{
    switch (irqn)
    {
#if !defined(CY_CPU_CORTEX_M4) || (CY_CPU_CORTEX_M4)
#if (CY_IP_MXAUDIOSS_INSTANCES == 1 && (defined(AUDIOSS_I2S) && AUDIOSS_I2S || defined(AUDIOSS_I2S_I2S) && AUDIOSS_I2S_I2S)) // Without index suffix
        case audioss_interrupt_i2s_IRQn:
            return 0;
#elif (CY_IP_MXAUDIOSS_INSTANCES >= 1 && defined(AUDIOSS0_I2S) && AUDIOSS0_I2S)
        case audioss_0_interrupt_i2s_IRQn:
            return 0;
#endif
#if (CY_IP_MXAUDIOSS_INSTANCES >= 2 && defined(AUDIOSS1_I2S) && AUDIOSS1_I2S)
        case audioss_1_interrupt_i2s_IRQn:
            return 1;
#endif
#if (CY_IP_MXS40AUDIOSS_INSTANCES > 2)
    #warning Unhandled audioss instance count
#endif
#endif /* (CY_CPU_CORTEX_M4) */
        default:
            CY_ASSERT(false); // Should never be called with a non-I2S IRQn
            return 0;
    }
}

#if defined(COMPONENT_CAT2) /* PSoC™ 4 uses a PCLK */
#define _CYHAL_AUDIOSS_USES_PCLK
static const en_clk_dst_t _cyhal_audioss_clock[] =
{
#if (CY_IP_MXAUDIOSS_INSTANCES == 1)
    PCLK_AUDIOSS_CLOCK_POS_I2S_EN,
#else
    #warning Unhandled audioss instance count
#endif
};
#endif

static void _cyhal_audioss_irq_handler(void);
typedef cy_stc_i2s_config_t _cyhal_audioss_pdl_config_t;

#elif defined(CY_IP_MXTDM) && (CY_IP_MXTDM_INSTANCES > 0)
#define _CYHAL_AUDIOSS_FIFO_DEPTH (128)

#define _CYHAL_AUDIOSS_TX_SCK_MAP cyhal_pin_map_tdm_tdm_tx_sck
#define _CYHAL_AUDIOSS_TX_WS_MAP  cyhal_pin_map_tdm_tdm_tx_fsync
#define _CYHAL_AUDIOSS_TX_SDO_MAP cyhal_pin_map_tdm_tdm_tx_sd
#define _CYHAL_AUDIOSS_RX_SCK_MAP cyhal_pin_map_tdm_tdm_rx_sck
#define _CYHAL_AUDIOSS_RX_WS_MAP  cyhal_pin_map_tdm_tdm_rx_fsync
#define _CYHAL_AUDIOSS_RX_SDI_MAP cyhal_pin_map_tdm_tdm_rx_sd

#define _CYHAL_AUDIOSS_DRIVE_MODE_TX_SCK    CYHAL_PIN_MAP_DRIVE_MODE_TDM_TDM_TX_SCK
#define _CYHAL_AUDIOSS_DRIVE_MODE_TX_WS     CYHAL_PIN_MAP_DRIVE_MODE_TDM_TDM_TX_FSYNC
#define _CYHAL_AUDIOSS_DRIVE_MODE_TX_SDO    CYHAL_PIN_MAP_DRIVE_MODE_TDM_TDM_TX_SD
#define _CYHAL_AUDIOSS_DRIVE_MODE_RX_SCK    CYHAL_PIN_MAP_DRIVE_MODE_TDM_TDM_RX_SCK
#define _CYHAL_AUDIOSS_DRIVE_MODE_RX_WS     CYHAL_PIN_MAP_DRIVE_MODE_TDM_TDM_RX_FSYNC
#define _CYHAL_AUDIOSS_DRIVE_MODE_RX_SDI    CYHAL_PIN_MAP_DRIVE_MODE_TDM_TDM_RX_SD

/* Per cy_en_tdm_clock_sel_t, only TX mclk_in is selectable for both.
 * This is probably a bug in the PDL, will be updated as necessary
 * following the resolution of DRIVERS-5376
 */
#define Cy_I2S_Init           Cy_AudioTDM_Init
#define Cy_I2S_DeInit         Cy_AudioTDM_DeInit

static cy_rslt_t _cyhal_audioss_length_to_pdl(uint8_t user_length, cy_en_tdm_ws_t *pdl_length, const _cyhal_audioss_t *obj);
static uint8_t _cyhal_audioss_length_from_pdl(cy_en_tdm_ws_t pdl_length);

static TDM_Type *const _cyhal_audioss_base[] =
{
#if (CY_IP_MXTDM_INSTANCES == 1)
    TDM0,
#else
    #warning Unhandled tdm instance count
#endif
};

static const uint8_t _cyhal_audioss_max_channels[] =
{
#if (CY_IP_MXTDM_INSTANCES == 1)
    #if (TDM_NR == 1)
        TDM_NR_CH_NR,
    #elif (TDM_NR == 2)
        TDM_NR0_CH_NR,
        TDM_NR1_CH_NR,
    #else
        #warning Unhandled TDM struct count
    #endif
#else
    #warning Unhandled tdm instance count
#endif
};

#define _CYHAL_AUDIOSS_USES_PCLK
static const en_clk_dst_t _cyhal_audioss_clock[] =
{
#if (CY_IP_MXTDM_INSTANCES == 1)
    PCLK_TDM0_CLK_IF_SRSS0,
#else
    #warning Unhandled tdm instance count
#endif
};

#define _CYHAL_AUDIOSS_TRIGGERS_AVAILABLE
static const cyhal_source_t _cyhal_audioss_rx_trigger[] =
{
#if (CY_IP_MXTDM_INSTANCES == 1)
    CYHAL_TRIGGER_TDM_TR_RX_REQ0,
#else
    #warning Unhandled tdm instance count
#endif
};

static const cyhal_source_t _cyhal_audioss_tx_trigger[] =
{
#if (CY_IP_MXTDM_INSTANCES == 1)
    CYHAL_TRIGGER_TDM_TR_TX_REQ0,
#else
    #warning Unhandled tdm instance count
#endif
};

static _cyhal_audioss_t* _cyhal_audioss_config_structs[CY_IP_MXTDM_INSTANCES];

static const IRQn_Type _cyhal_audioss_tx_irq_n[] =
{
#if (CY_IP_MXTDM_INSTANCES == 1)
    tdm_0_interrupts_tx_0_IRQn,
#else
    #warning Unhandled tdm instance count
#endif
};

static const IRQn_Type _cyhal_audioss_rx_irq_n[] =
{
#if (CY_IP_MXTDM_INSTANCES == 1)
    tdm_0_interrupts_rx_0_IRQn,
#else
    #warning Unhandled tdm instance count
#endif
};

static uint8_t _cyhal_audioss_get_block_from_irqn(IRQn_Type irqn) {
    switch (irqn)
    {
#if (CY_IP_MXTDM_INSTANCES == 1)
        case tdm_0_interrupts_tx_0_IRQn:
        case tdm_0_interrupts_rx_0_IRQn:
            return 0;
#else
    #warning Unhandled tdm instance count
#endif
        default:
            CY_ASSERT(false); // Should never be called with a non-TDM IRQn
            return 0;
    }
}

static void _cyhal_audioss_irq_handler_rx(void);
static void _cyhal_audioss_irq_handler_tx(void);
typedef cy_stc_tdm_config_t _cyhal_audioss_pdl_config_t;

#else
#error "Unrecognized audio IP"
#endif

