zephyrproject-rtos/hal_infineon/mtb-hal-cat1/COMPONENT_PSOC6HAL/source/cyhal_audio_common.c
static void _cyhal_audioss_update_enabled_events(_cyhal_audioss_t* obj);
static void _cyhal_audioss_process_event(_cyhal_audioss_t *obj, uint32_t event);
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
static void _cyhal_audioss_update_rx_trigger_level(_cyhal_audioss_t* obj);
#endif
static uint32_t _cyhal_audioss_disable_events(_cyhal_audioss_t *obj, bool tx);
static void _cyhal_audioss_restore_events(_cyhal_audioss_t *obj, bool tx, uint32_t old_events);
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
static cy_rslt_t _cyhal_audioss_dma_perform_rx(_cyhal_audioss_t *obj);
#endif
static cy_rslt_t _cyhal_audioss_dma_perform_tx(_cyhal_audioss_t *obj);
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
static void _cyhal_audioss_dma_handler_rx(void *callback_arg, cyhal_dma_event_t event);
#endif
static void _cyhal_audioss_dma_handler_tx(void *callback_arg, cyhal_dma_event_t event);
static uint8_t _cyhal_audioss_rounded_word_length(_cyhal_audioss_t *obj, bool is_tx);
static bool _cyhal_audioss_pm_callback(cyhal_syspm_callback_state_t state, cyhal_syspm_callback_mode_t mode, void* callback_arg);
static cy_rslt_t _cyhal_audioss_populate_pdl_config(_cyhal_audioss_t *obj, _cyhal_audioss_pdl_config_t* pdl_config,
                                                    const _cyhal_audioss_config_t* hal_cfg,
                                                    uint16_t sclk_div_rx, uint16_t sclk_div_tx,
                                                    bool rx_en, bool tx_en, bool mclk_rx, bool mclk_tx);
static void _cyhal_audioss_reconstruct_pdl_config(_cyhal_audioss_t *obj, _cyhal_audioss_pdl_config_t* pdl_config);
static cy_rslt_t _cyhal_audioss_compute_sclk_div(_cyhal_audioss_t *obj, uint32_t sample_rate_hz, uint32_t mclk_hz, uint8_t channel_length, uint8_t num_channels, uint16_t *sclk_div);
static uint32_t _cyhal_audioss_get_num_in_fifo(_cyhal_audioss_t *obj, bool is_tx);
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
static uint32_t _cyhal_audioss_read_fifo(_cyhal_audioss_t *obj);
#endif
static void _cyhal_audioss_write_fifo(_cyhal_audioss_t *obj, uint32_t value);

cy_rslt_t _cyhal_audioss_init_clock(_cyhal_audioss_t *obj, const cyhal_clock_t* clk, bool all_mclk)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    if (clk != NULL)
    {
        obj->clock = *clk;
    }
    else if (false == all_mclk) // No need to reserve a clock if we're using the mclk pin
    {
        // The hardware is generally going to be hardwired to an hfclk, which has very limited divider options. In the event
        // that we're hooked up a PERI divider, we don't have any particular expectations about its width - so just ask for 16-bit or larger
        result = _cyhal_utils_allocate_clock(&(obj->clock), &(obj->resource), CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT, true);
        if(CY_RSLT_SUCCESS == result)
        {
            obj->is_clock_owned = true;
            result = cyhal_clock_set_enabled(&(obj->clock), true, true);
        }
    }

#if defined(_CYHAL_AUDIOSS_USES_PCLK)
    // If we're not using MCLK, and we're using a peri divider, hook it up to ourself
    bool any_mclk = (0u != obj->mclk_hz_tx);
    #if defined(_CYHAL_AUDIOSS_RX_ENABLED)
        any_mclk = any_mclk || (0u != obj->mclk_hz_rx);
    #endif
    if (CY_RSLT_SUCCESS == result && false == any_mclk && obj->clock.block != CYHAL_CLOCK_BLOCK_HF)
    {
        en_clk_dst_t pclk = _cyhal_audioss_clock[obj->resource.block_num];
        if (CY_SYSCLK_SUCCESS != _cyhal_utils_peri_pclk_assign_divider(pclk, &(obj->clock)))
            result = obj->interface->err_clock;
    }
#endif

    return result;
}

cy_rslt_t _cyhal_audioss_init_pdl(_cyhal_audioss_t *obj, const _cyhal_audioss_pdl_config_t* pdl_config)
{
    cy_rslt_t result = (cy_rslt_t)Cy_I2S_Init(obj->base, pdl_config);

#if defined(CY_IP_MXTDM)
    if(CY_RSLT_SUCCESS == result)
    {
        // PDL init doesn't automatically enable the RX-TX sub-blocks
        if(pdl_config->tx_config->enable)
        {
            Cy_AudioTDM_EnableTx(&obj->base->TDM_TX_STRUCT);
        }
        if(pdl_config->rx_config->enable)
        {
            Cy_AudioTDM_EnableRx(&obj->base->TDM_RX_STRUCT);
        }
    }
#endif
    return result;
}

cy_rslt_t _cyhal_audioss_init_hw(_cyhal_audioss_t *obj, const _cyhal_audioss_pdl_config_t* pdl_config)
{
#if defined(CY_IP_MXAUDIOSS)
    obj->base = _cyhal_audioss_base[obj->resource.block_num];
#elif defined(CY_IP_MXTDM)
    obj->base = &(_cyhal_audioss_base[obj->resource.block_num]->TDM_STRUCT[obj->resource.channel_num]);
#endif

    cy_rslt_t result = _cyhal_audioss_init_pdl(obj, pdl_config);

    if (CY_RSLT_SUCCESS == result)
    {
#if defined(CY_IP_MXAUDIOSS) && defined(_CYHAL_AUDIOSS_RX_ENABLED)
        obj->user_fifo_level_rx = pdl_config->rxFifoTriggerLevel;
#elif defined(CY_IP_MXTDM)
        obj->user_fifo_level_rx = pdl_config->rx_config->fifoTriggerLevel;
#endif
        /* No way to explicitly clear the FIFO on the TDM IP, but
         * it is cleared as a side effect of the FIFO being disabled
         * which it should be both at startup and after a free/init cycle
         */
#if defined(CY_IP_MXAUDIOSS)
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
        if(pdl_config->txEnabled)
        {
            Cy_I2S_ClearTxFifo(obj->base);
        }
        if(pdl_config->rxEnabled)
        {
            Cy_I2S_ClearRxFifo(obj->base);
        }
#else
        Cy_I2S_ClearTxFifo(obj->base);
#endif
#endif

        obj->pm_callback.states = (cyhal_syspm_callback_state_t)(CYHAL_SYSPM_CB_CPU_DEEPSLEEP | CYHAL_SYSPM_CB_SYSTEM_HIBERNATE);
        obj->pm_callback.callback = &_cyhal_audioss_pm_callback;
        obj->pm_callback.next = NULL;
        obj->pm_callback.args = (void*)obj;
        obj->pm_callback.ignore_modes = CYHAL_SYSPM_BEFORE_TRANSITION;
        obj->pm_transition_ready = false;
        _cyhal_syspm_register_peripheral_callback(&(obj->pm_callback));

        _cyhal_audioss_config_structs[obj->resource.block_num] = obj;
#if defined(CY_IP_MXAUDIOSS)
        cy_stc_sysint_t irqCfg = { _cyhal_audioss_irq_n[obj->resource.block_num], CYHAL_ISR_PRIORITY_DEFAULT };
        Cy_SysInt_Init(&irqCfg, _cyhal_audioss_irq_handler);
        NVIC_EnableIRQ(_cyhal_audioss_irq_n[obj->resource.block_num]);
#elif defined(CY_IP_MXTDM)
        cy_stc_sysint_t irqCfgRx = { _cyhal_audioss_rx_irq_n[obj->resource.block_num], CYHAL_ISR_PRIORITY_DEFAULT };
        Cy_SysInt_Init(&irqCfgRx, _cyhal_audioss_irq_handler_rx);
        NVIC_EnableIRQ(_cyhal_audioss_rx_irq_n[obj->resource.block_num]);

        cy_stc_sysint_t irqCfgTx = { _cyhal_audioss_tx_irq_n[obj->resource.block_num], CYHAL_ISR_PRIORITY_DEFAULT };
        Cy_SysInt_Init(&irqCfgTx, _cyhal_audioss_irq_handler_tx);
        NVIC_EnableIRQ(_cyhal_audioss_tx_irq_n[obj->resource.block_num]);
#else
#error "Unrecognized audio IP"
#endif
    }

    return result;
}

cy_rslt_t _cyhal_audioss_init(_cyhal_audioss_t *obj, const _cyhal_audioss_pins_t* tx_pins, const _cyhal_audioss_pins_t* rx_pins, const _cyhal_audioss_config_t* config, cyhal_clock_t* clk, const _cyhal_audioss_interface_t* interface)
{
    CY_ASSERT(NULL != obj);

    memset(obj, 0, sizeof(_cyhal_audioss_t));
    /* Explicitly marked not allocated resources as invalid to prevent freeing them. */
    obj->resource.type = CYHAL_RSC_INVALID;
    obj->pin_tx_sck    = CYHAL_NC_PIN_VALUE;
    obj->pin_tx_ws     = CYHAL_NC_PIN_VALUE;
    obj->pin_tx_sdo    = CYHAL_NC_PIN_VALUE;
    obj->pin_tx_mclk   = CYHAL_NC_PIN_VALUE;
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    obj->pin_rx_sck    = CYHAL_NC_PIN_VALUE;
    obj->pin_rx_ws     = CYHAL_NC_PIN_VALUE;
    obj->pin_rx_sdi    = CYHAL_NC_PIN_VALUE;
    obj->pin_rx_mclk   = CYHAL_NC_PIN_VALUE;
#endif

    obj->interface         = interface;
    obj->channel_length_tx = config->channel_length;
    obj->word_length_tx    = config->word_length;
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    obj->channel_length_rx = config->channel_length;
    obj->word_length_rx    = config->word_length;
#endif

