zephyrproject-rtos/hal_infineon/mtb-hal-cat1/COMPONENT_PSOC6HAL/source/cyhal_audio_common.c
    if(obj->is_clock_owned)
    {
        // Try each of the divider values that we support internally, and see whether any of them gets us
        // within our tolerance of a frequency that our source clock can provide.
        for(uint16_t i = MIN_SCLK_DIVIDER; i <= MAX_SCLK_DIVIDER; i += SCLK_INCREMENT)
        {
#if defined(CY_IP_MXAUDIOSS)
            // This IP has a hard-wired 8x divider
            uint32_t desired_source_freq = sclk_target * i * 8;
#elif defined(CY_IP_MXTDM)
            uint32_t desired_source_freq = sclk_target * i;
#endif
            cy_rslt_t freq_result = _cyhal_utils_set_clock_frequency(&(obj->clock), desired_source_freq, &SCLK_TOLERANCE);
            if(CY_RSLT_SUCCESS == freq_result)
            {
                *sclk_div = i;
                break;
            }
        }
    }
    else // Using user-provided clock, or using the mclk pin
    {
        // We can't change the clock, so just check if it's within tolerance
#if defined(CY_IP_MXAUDIOSS)
        uint32_t desired_divided_freq = sclk_target * 8; // I2S hw has a hard-wired 8x divider
#elif defined(CY_IP_MXTDM)
        uint32_t desired_divided_freq = sclk_target;
#endif
        uint32_t actual_source_freq = (0u != mclk_hz) ? mclk_hz : cyhal_clock_get_frequency(&obj->clock);
        uint32_t best_divider = (actual_source_freq + (desired_divided_freq / 2)) / desired_divided_freq; // Round to nearest divider
        uint32_t desired_source_freq = desired_divided_freq * best_divider;
        uint32_t diff = (uint32_t)abs(_cyhal_utils_calculate_tolerance(SCLK_TOLERANCE.type, desired_source_freq, actual_source_freq));
        if(diff <= SCLK_TOLERANCE.value && best_divider <= MAX_SCLK_DIVIDER)
        {
            *sclk_div = (uint16_t)best_divider;
        }
    }

    return (0 == *sclk_div) ? obj->interface->err_clock : CY_RSLT_SUCCESS;
}

cy_rslt_t _cyhal_audioss_set_sample_rate(_cyhal_audioss_t *obj, uint32_t sample_rate_hz)
{
    uint16_t sclk_div_tx;
    _cyhal_audioss_pdl_config_t pdl_config;
#if defined(CY_IP_MXTDM)
    cy_stc_tdm_config_tx_t tx_config;
    cy_stc_tdm_config_rx_t rx_config;
    pdl_config.tx_config = &tx_config;
    pdl_config.rx_config = &rx_config;
#endif
    _cyhal_audioss_reconstruct_pdl_config(obj, &pdl_config);
#if defined(CY_IP_MXAUDIOSS)
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    uint8_t rx_channels = pdl_config.rxChannels;
#endif
    uint8_t tx_channels = pdl_config.txChannels;
#elif defined(CY_IP_MXTDM)
     uint8_t rx_channels = pdl_config.rx_config->channelNum;
     uint8_t tx_channels = pdl_config.tx_config->channelNum;
#endif /* _CYHAL_AUDIOSS_RX_ENABLED */
    cy_rslt_t result = _cyhal_audioss_compute_sclk_div(obj, sample_rate_hz, obj->mclk_hz_tx, obj->channel_length_tx, tx_channels, &sclk_div_tx);
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    uint16_t sclk_div_rx;
    if(CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_audioss_compute_sclk_div(obj, sample_rate_hz, obj->mclk_hz_rx, obj->channel_length_rx, rx_channels, &sclk_div_rx);
    }
#endif /* _CYHAL_AUDIOSS_RX_ENABLED */
    if(CY_RSLT_SUCCESS == result)
    {
#if defined(CY_IP_MXAUDIOSS)
        pdl_config.clkDiv = (uint8_t)(sclk_div_tx);
#elif defined(CY_IP_MXTDM)
        pdl_config.tx_config->clkDiv = sclk_div_tx;
        pdl_config.rx_config->clkDiv = sclk_div_rx;
#endif
        Cy_I2S_DeInit(obj->base);

        result = _cyhal_audioss_init_pdl(obj, &pdl_config);
    }

    return result;
}

void _cyhal_audioss_enable_event(_cyhal_audioss_t *obj, uint32_t event, uint8_t intr_priority, bool enable)
{
    CY_ASSERT(NULL != obj);

    if (enable)
    {
        obj->user_enabled_events |= event;
    }
    else
    {
        obj->user_enabled_events &= ~event;
    }

    _cyhal_audioss_update_enabled_events(obj);
#if defined(CY_IP_MXAUDIOSS)
    IRQn_Type irqn = _cyhal_audioss_irq_n[obj->resource.block_num];
    NVIC_SetPriority(irqn, intr_priority);
#elif defined(CY_IP_MXTDM)
    IRQn_Type irqn = _cyhal_audioss_tx_irq_n[obj->resource.block_num];
    NVIC_SetPriority(irqn, intr_priority);
    irqn = _cyhal_audioss_rx_irq_n[obj->resource.block_num];
    NVIC_SetPriority(irqn, intr_priority);
#endif
}

cy_rslt_t _cyhal_audioss_start_tx(_cyhal_audioss_t *obj)
{
    if (obj->pm_transition_ready)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }
#if defined(CY_IP_MXAUDIOSS)
    Cy_I2S_EnableTx(obj->base);
#elif defined(CY_IP_MXTDM)
    Cy_AudioTDM_ActivateTx(&obj->base->TDM_TX_STRUCT);
#endif
    return CY_RSLT_SUCCESS;
}

cy_rslt_t _cyhal_audioss_stop_tx(_cyhal_audioss_t *obj)
{
#if defined(CY_IP_MXAUDIOSS)
    Cy_I2S_DisableTx(obj->base);
#elif defined(CY_IP_MXTDM)
    // Not disable - that is more aggressive than we want
    Cy_AudioTDM_DeActivateTx(&obj->base->TDM_TX_STRUCT);
#endif
    return CY_RSLT_SUCCESS;
}

cy_rslt_t _cyhal_audioss_clear_tx(_cyhal_audioss_t *obj)
{
#if defined(CY_IP_MXAUDIOSS)
    Cy_I2S_ClearTxFifo(obj->base);
#elif defined(CY_IP_MXTDM)
    /* No way to explicitly clear the FIFO, so disable and re-enable
     * which will clear the FIFO as a side effect, while retaining
     * all other configuration */
     bool was_active = _cyhal_audioss_is_tx_enabled(obj);
     Cy_AudioTDM_DisableTx(&obj->base->TDM_TX_STRUCT);
     Cy_AudioTDM_EnableTx(&obj->base->TDM_TX_STRUCT);
     if(was_active)
     {
         Cy_AudioTDM_ActivateTx(&obj->base->TDM_TX_STRUCT);
     }
#endif
    return CY_RSLT_SUCCESS;
}

cy_rslt_t _cyhal_audioss_start_rx(_cyhal_audioss_t *obj)
{
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    if (obj->pm_transition_ready)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }
#if defined(CY_IP_MXAUDIOSS)
    Cy_I2S_EnableRx(obj->base);
#elif defined(CY_IP_MXTDM)
    Cy_AudioTDM_ActivateRx(&obj->base->TDM_RX_STRUCT);
#endif
    return CY_RSLT_SUCCESS;
#else
    return obj->interface->err_not_supported;
#endif
}

cy_rslt_t _cyhal_audioss_stop_rx(_cyhal_audioss_t *obj)
{
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
#if defined(CY_IP_MXAUDIOSS)
    Cy_I2S_DisableRx(obj->base);
#elif defined(CY_IP_MXTDM)
    // Not disable - that is more aggressive than we want
    Cy_AudioTDM_DeActivateRx(&obj->base->TDM_RX_STRUCT);
#endif
    return CY_RSLT_SUCCESS;
#else
    return obj->interface->err_not_supported;
#endif
}

