zephyrproject-rtos/hal_infineon/mtb-hal-cat1/COMPONENT_PSOC6HAL/source/cyhal_audio_common.c
#if defined(_CYHAL_AUDIOSS_TX_WATCHDOG_AVAILABLE)
        pdl_config->txWatchdogEnable = _FLD2BOOL(I2S_TX_CTL_WD_EN, rx_ctl_val);;
        pdl_config->txWatchdogValue = REG_I2S_TX_WATCHDOG(base);
#endif

#if defined(_CYHAL_AUDIOSS_TRIGGERS_AVAILABLE)
        pdl_config->txDmaTrigger = _FLD2BOOL(I2S_TR_CTL_TX_REQ_EN, REG_I2S_TR_CTL(base));
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
        pdl_config->rxDmaTrigger = _FLD2BOOL(I2S_TR_CTL_RX_REQ_EN, REG_I2S_TR_CTL(base));;
#endif
#endif /* _CYHAL_AUDIOSS_RX_ENABLED */

    uint32_t tx_ctl_val = REG_I2S_TX_CTL(base);
#if defined(_CYHAL_AUDIOSS_TX_SLAVE_AVAILABLE)
        pdl_config->txMasterMode = _FLD2BOOL(I2S_TX_CTL_MS, tx_ctl_val);
        pdl_config->txSckiInversion = _FLD2BOOL(I2S_TX_CTL_SCKI_POL, tx_ctl_val);
        pdl_config->txSdoLatchingTime = _FLD2BOOL(I2S_TX_CTL_B_CLOCK_INV, tx_ctl_val);;
#endif
    /* Register value is 1 less than the desired divider */
    pdl_config->clkDiv = ((uint8_t)_FLD2VAL(I2S_CLOCK_CTL_CLOCK_DIV, REG_I2S_CLOCK_CTL(base))) + 1;
    pdl_config->extClk = _FLD2BOOL(I2S_CLOCK_CTL_CLOCK_SEL, REG_I2S_CLOCK_CTL(base));

    /* TDM mode A == channel data starts on rising edge of WS */
    pdl_config->txAlignment = (cy_en_i2s_alignment_t)_FLD2VAL(I2S_TX_CTL_I2S_MODE, tx_ctl_val);
    pdl_config->txWsPulseWidth = (cy_en_i2s_ws_pw_t)_FLD2VAL(I2S_TX_CTL_WS_PULSE, tx_ctl_val);

    pdl_config->txSckoInversion = _FLD2BOOL(I2S_TX_CTL_SCKO_POL, tx_ctl_val);

    /* Register is one less than desired value */
    pdl_config->txChannels = ((uint8_t)_FLD2VAL(I2S_TX_CTL_CH_NR, tx_ctl_val)) + 1;
    pdl_config->txChannelLength = (cy_en_i2s_len_t)_FLD2VAL(I2S_TX_CTL_CH_LEN, tx_ctl_val);
    pdl_config->txWordLength = (cy_en_i2s_len_t)_FLD2VAL(I2S_TX_CTL_WORD_LEN, tx_ctl_val);
    pdl_config->txOverheadValue = (cy_en_i2s_overhead_t)_FLD2VAL(I2S_TX_CTL_OVHDATA, tx_ctl_val);
    pdl_config->txFifoTriggerLevel = _cyhal_audioss_fifo_trigger_level(obj, true);
#elif defined(CY_IP_MXTDM)
    TDM_TX_STRUCT_Type* base_tx = &obj->base->TDM_TX_STRUCT;
    TDM_RX_STRUCT_Type* base_rx = &obj->base->TDM_RX_STRUCT;

    /* Configure TX */
    pdl_config->tx_config->enable = _cyhal_audioss_is_direction_enabled(obj, true);
    pdl_config->tx_config->masterMode = (cy_en_tdm_device_cfg_t)_FLD2VAL(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_CTL_MS, TDM_STRUCT_TX_CTL(base_tx));
    pdl_config->tx_config->wordSize = (cy_en_tdm_ws_t)_FLD2VAL(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_CTL_WORD_SIZE, TDM_STRUCT_TX_CTL(base_tx));
    pdl_config->tx_config->format = (cy_en_tdm_format_t)_FLD2VAL(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_CTL_FORMAT, TDM_STRUCT_TX_CTL(base_tx));

    uint32_t tx_if_ctl = TDM_STRUCT_TX_IF_CTL(base_tx);
    /* Divider in the config register is a less than the desired value */
    pdl_config->tx_config->clkDiv = (uint16_t)(_FLD2VAL(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_IF_CTL_CLOCK_DIV, tx_if_ctl) + 1);
    pdl_config->tx_config->clkSel = (cy_en_tdm_clock_sel_t)_FLD2VAL(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_IF_CTL_CLOCK_SEL, tx_if_ctl);
    pdl_config->tx_config->sckPolarity = (cy_en_tdm_sckpolarity_t)_FLD2VAL(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_IF_CTL_SCK_POLARITY, tx_if_ctl);;
    pdl_config->tx_config->fsyncPolarity = (cy_en_tdm_fsyncpolarity_t)_FLD2VAL(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_IF_CTL_FSYNC_POLARITY, tx_if_ctl);;
    pdl_config->tx_config->fsyncFormat = (cy_en_tdm_fsyncformat_t)_FLD2VAL(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_IF_CTL_FSYNC_FORMAT, tx_if_ctl);
    /* Channel size and count in the register are one less than the desired value */
    pdl_config->tx_config->channelNum = (uint8_t)_FLD2VAL(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_IF_CTL_CH_NR, tx_if_ctl) + 1;
    pdl_config->tx_config->channelSize = (uint8_t)_FLD2VAL(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_IF_CTL_CH_SIZE, tx_if_ctl) + 1;
    pdl_config->tx_config->fifoTriggerLevel = _cyhal_audioss_fifo_trigger_level(obj, true);
    pdl_config->tx_config->chEn = TDM_STRUCT_TX_CH_CTL(base_tx);
    pdl_config->tx_config->signalInput = _FLD2VAL(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_ROUTE_CTL_MODE, TDM_STRUCT_TX_ROUTE_CTL(base_tx));
    pdl_config->tx_config->i2sMode = _FLD2BOOL(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_IF_CTL_I2S_MODE, tx_if_ctl);

    /* Configure RX */
    pdl_config->rx_config->enable = _cyhal_audioss_is_direction_enabled(obj, false);
    pdl_config->rx_config->masterMode = (cy_en_tdm_device_cfg_t)_FLD2VAL(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_CTL_MS, TDM_STRUCT_RX_CTL(base_rx));
    pdl_config->rx_config->wordSize = (cy_en_tdm_ws_t)_FLD2VAL(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_CTL_WORD_SIZE, TDM_STRUCT_RX_CTL(base_rx));
    pdl_config->rx_config->format = (cy_en_tdm_format_t)_FLD2VAL(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_CTL_FORMAT, TDM_STRUCT_RX_CTL(base_rx));

    uint32_t rx_if_ctl = TDM_STRUCT_RX_IF_CTL(base_rx);
    /* Divider in the config register is a less than the desired value */
    pdl_config->rx_config->clkDiv = (uint16_t)(_FLD2VAL(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_IF_CTL_CLOCK_DIV, rx_if_ctl) + 1);
    pdl_config->rx_config->clkSel = (cy_en_tdm_clock_sel_t)_FLD2VAL(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_IF_CTL_CLOCK_SEL, rx_if_ctl);
    pdl_config->rx_config->sckPolarity = (cy_en_tdm_sckpolarity_t)_FLD2VAL(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_IF_CTL_SCK_POLARITY, rx_if_ctl);
    pdl_config->rx_config->fsyncPolarity = (cy_en_tdm_fsyncpolarity_t)_FLD2VAL(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_IF_CTL_FSYNC_POLARITY, rx_if_ctl);;
    pdl_config->rx_config->fsyncFormat = (cy_en_tdm_fsyncformat_t)_FLD2VAL(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_IF_CTL_FSYNC_FORMAT, rx_if_ctl);
    /* Channel size and count in the register are one less than the desired value */
    pdl_config->rx_config->channelNum = (uint8_t)_FLD2VAL(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_IF_CTL_CH_NR, rx_if_ctl) + 1;
    pdl_config->rx_config->channelSize = (uint8_t)_FLD2VAL(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_IF_CTL_CH_SIZE, rx_if_ctl) + 1;
    pdl_config->rx_config->fifoTriggerLevel = _cyhal_audioss_fifo_trigger_level(obj, false);
    pdl_config->rx_config->chEn = TDM_STRUCT_RX_CH_CTL(base_rx);
    pdl_config->rx_config->signalInput = _FLD2VAL(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_ROUTE_CTL_MODE, TDM_STRUCT_RX_ROUTE_CTL(base_rx));
    pdl_config->rx_config->i2sMode = _FLD2BOOL(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_IF_CTL_I2S_MODE, rx_if_ctl);
#else
#error "Unrecognized audio IP"
#endif
}

static cy_rslt_t _cyhal_audioss_populate_pdl_config(_cyhal_audioss_t *obj, _cyhal_audioss_pdl_config_t* pdl_config,
                                                    const _cyhal_audioss_config_t* hal_cfg,
                                                    uint16_t sclk_div_rx, uint16_t sclk_div_tx,
                                                    bool rx_en, bool tx_en, bool mclk_rx, bool mclk_tx)
{
#if defined(CY_IP_MXAUDIOSS)
    cy_en_i2s_len_t pdl_word_length_tx, pdl_channel_length_tx;
    cy_rslt_t result = _cyhal_audioss_length_to_pdl(obj->channel_length_tx, &pdl_channel_length_tx, obj);
    if (CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_audioss_length_to_pdl(obj->word_length_tx, &pdl_word_length_tx, obj);
    }
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    cy_en_i2s_len_t pdl_word_length_rx, pdl_channel_length_rx;
    if (CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_audioss_length_to_pdl(obj->channel_length_rx, &pdl_channel_length_rx, obj);
    }
    if (CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_audioss_length_to_pdl(obj->word_length_rx, &pdl_word_length_rx, obj);
    }
#endif

    if(CY_RSLT_SUCCESS == result)
    {
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
        pdl_config->txEnabled = tx_en;
        pdl_config->rxEnabled = rx_en;

        pdl_config->rxMasterMode = !hal_cfg->is_rx_slave;
        pdl_config->rxAlignment = hal_cfg->is_i2s ? CY_I2S_I2S_MODE : CY_I2S_TDM_MODE_A;
        pdl_config->rxWsPulseWidth = hal_cfg->rx_ws_full
                                ? CY_I2S_WS_ONE_CHANNEL_LENGTH : CY_I2S_WS_ONE_SCK_CYCLE;
        pdl_config->rxWatchdogEnable = false;
        pdl_config->rxWatchdogValue = 0u;
        pdl_config->rxSdiLatchingTime = false;
        pdl_config->rxSckoInversion = false;
        pdl_config->rxSckiInversion = false;
        pdl_config->rxChannels = hal_cfg->num_channels;
        pdl_config->rxChannelLength = pdl_channel_length_rx;
        pdl_config->rxWordLength = pdl_word_length_rx;
        pdl_config->rxSignExtension = false; /* All MSB are filled by zeros, per HAL API specification */
        pdl_config->rxFifoTriggerLevel = _CYHAL_AUDIOSS_FIFO_DEPTH / 2 - 1; // Trigger at half full
#else
        CY_UNUSED_PARAMETER(rx_en);
        CY_UNUSED_PARAMETER(tx_en);
#endif

