zephyrproject-rtos/hal_infineon/mtb-hal-cat1/COMPONENT_PSOC6HAL/source/cyhal_audio_common.c
bool _cyhal_audioss_is_read_pending(_cyhal_audioss_t *obj)
{
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    return (NULL != obj->async_rx_buff);
#else
    CY_UNUSED_PARAMETER(obj);
    return false;
#endif
}

bool _cyhal_audioss_is_write_pending(_cyhal_audioss_t *obj)
{
    return (NULL != obj->async_tx_buff);
}

cy_rslt_t _cyhal_audioss_abort_read_async(_cyhal_audioss_t *obj)
{
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    uint32_t saved_intr = cyhal_system_critical_section_enter();
    obj->async_rx_buff = NULL;
    _cyhal_audioss_update_enabled_events(obj);
    cyhal_system_critical_section_exit(saved_intr);
    return CY_RSLT_SUCCESS;
#else
    return obj->interface->err_not_supported;
#endif
}

cy_rslt_t _cyhal_audioss_abort_write_async(_cyhal_audioss_t *obj)
{
    uint32_t saved_intr = cyhal_system_critical_section_enter();
    obj->async_tx_buff = NULL;
    _cyhal_audioss_update_enabled_events(obj);
    cyhal_system_critical_section_exit(saved_intr);
    return CY_RSLT_SUCCESS;
}

#if defined(CY_IP_MXAUDIOSS)
static uint8_t _cyhal_audioss_length_from_pdl(cy_en_i2s_len_t pdl_length)
{
    switch(pdl_length)
    {
        case CY_I2S_LEN8:
            return 8u;
        case CY_I2S_LEN16:
            return 16u;
        case CY_I2S_LEN18:
            return 18u;
        case CY_I2S_LEN20:
            return 20u;
        case CY_I2S_LEN24:
            return 24u;
        case CY_I2S_LEN32:
            return 32u;
        default:
            CY_ASSERT(false); /* Should never get here */
            return 32u;
    }
}

static cy_rslt_t _cyhal_audioss_length_to_pdl(uint8_t user_length, cy_en_i2s_len_t *pdl_length, const _cyhal_audioss_t *obj)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    switch(user_length)
    {
        case 8u:
            *pdl_length = CY_I2S_LEN8;
            break;
        case 16u:
            *pdl_length = CY_I2S_LEN16;
            break;
        case 18u:
            *pdl_length = CY_I2S_LEN18;
            break;
        case 20u:
            *pdl_length = CY_I2S_LEN20;
            break;
        case 24u:
            *pdl_length = CY_I2S_LEN24;
            break;
        case 32u:
            *pdl_length = CY_I2S_LEN32;
            break;
        default:
            *pdl_length = CY_I2S_LEN32;
            result = obj->interface->err_invalid_arg;
    }
    return result;
}
#elif defined(CY_IP_MXTDM)
static uint8_t _cyhal_audioss_length_from_pdl(cy_en_tdm_ws_t pdl_length)
{
    switch(pdl_length)
    {
        case CY_TDM_SIZE_8:
            return 8u;
        case CY_TDM_SIZE_10:
            return 10u;
        case CY_TDM_SIZE_12:
            return 12u;
        case CY_TDM_SIZE_14:
            return 14u;
        case CY_TDM_SIZE_16:
            return 16u;
        case CY_TDM_SIZE_18:
            return 18u;
        case CY_TDM_SIZE_20:
            return 20u;
        case CY_TDM_SIZE_24:
            return 24u;
        case CY_TDM_SIZE_32:
            return 32u;
        default:
            CY_ASSERT(false); /* Should never get here */
            return 32u;
    }
}

static cy_rslt_t _cyhal_audioss_length_to_pdl(uint8_t user_length, cy_en_tdm_ws_t *pdl_length, const _cyhal_audioss_t *obj)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    switch(user_length)
    {
        case 8u:
            *pdl_length = CY_TDM_SIZE_8;
            break;
        case 10u:
            *pdl_length = CY_TDM_SIZE_10;
            break;
        case 12u:
            *pdl_length = CY_TDM_SIZE_12;
            break;
        case 14u:
            *pdl_length = CY_TDM_SIZE_14;
            break;
        case 16u:
            *pdl_length = CY_TDM_SIZE_16;
            break;
        case 18u:
            *pdl_length = CY_TDM_SIZE_18;
            break;
        case 20u:
            *pdl_length = CY_TDM_SIZE_20;
            break;
        case 24u:
            *pdl_length = CY_TDM_SIZE_24;
            break;
        case 32u:
            *pdl_length = CY_TDM_SIZE_32;
            break;
        default:
            *pdl_length = CY_TDM_SIZE_32;
            result = obj->interface->err_invalid_arg;
    }
    return result;
}
#else
#error "Unrecognized audio IP"
#endif

#if defined(CY_IP_MXAUDIOSS)
void _cyhal_audioss_irq_handler(void)
{
    IRQn_Type irqn = _CYHAL_UTILS_GET_CURRENT_IRQN();
    uint8_t block = _cyhal_audioss_get_block_from_irqn(irqn);
    _cyhal_audioss_t* obj = _cyhal_audioss_config_structs[block];

    uint32_t interrupt_status = Cy_I2S_GetInterruptStatusMasked(obj->base);
    Cy_I2S_ClearInterrupt(obj->base, interrupt_status);
    uint32_t event = obj->interface->convert_interrupt_cause(interrupt_status);
    _cyhal_audioss_process_event(obj, event);
}
#elif defined(CY_IP_MXTDM)
void _cyhal_audioss_irq_handler_rx()
{
    IRQn_Type irqn = _CYHAL_UTILS_GET_CURRENT_IRQN();
    uint8_t block = _cyhal_audioss_get_block_from_irqn(irqn);
    _cyhal_audioss_t* obj = _cyhal_audioss_config_structs[block];

    uint32_t interrupt_status = Cy_AudioTDM_GetRxInterruptStatusMasked(&obj->base->TDM_RX_STRUCT);
    Cy_AudioTDM_ClearRxInterrupt(&obj->base->TDM_RX_STRUCT, interrupt_status);
    uint32_t event = obj->interface->convert_interrupt_cause(interrupt_status, false);
    _cyhal_audioss_process_event(obj, event);
}

void _cyhal_audioss_irq_handler_tx()
{
    IRQn_Type irqn = _CYHAL_UTILS_GET_CURRENT_IRQN();
    uint8_t block = _cyhal_audioss_get_block_from_irqn(irqn);
    _cyhal_audioss_t* obj = _cyhal_audioss_config_structs[block];

    uint32_t interrupt_status = Cy_AudioTDM_GetTxInterruptStatusMasked(&obj->base->TDM_TX_STRUCT);
    Cy_AudioTDM_ClearTxInterrupt(&obj->base->TDM_TX_STRUCT, interrupt_status);
    uint32_t event = obj->interface->convert_interrupt_cause(interrupt_status, true);
    _cyhal_audioss_process_event(obj, event);
}
#endif

static void _cyhal_audioss_update_enabled_events(_cyhal_audioss_t *obj)
{
    uint32_t events = obj->user_enabled_events;
    if(NULL != obj->async_tx_buff && obj->async_tx_length > 0)
    {
        events |= (obj->interface->event_mask_empty | obj->interface->event_mask_half_empty);
    }
#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
    if(NULL != obj->async_rx_buff && obj->async_rx_length > 0)
    {
        events |= (obj->interface->event_mask_full | obj->interface->event_mask_half_full);
    }
#endif

