zephyrproject-rtos/hal_infineon/mtb-hal-cat1/COMPONENT_PSOC6HAL/source/cyhal_audio_common.c
#if defined(CY_IP_MXAUDIOSS)
    uint32_t mask = obj->interface->convert_to_pdl(events);
    // The register is 24 bits wide but the hardware pads the value out with 1's when read.
    // So mask down to just the bits that we actually care about.
    uint32_t old_mask = Cy_I2S_GetInterruptMask(obj->base) & CY_I2S_INTR_MASK;

    // Clear the interrupts that are about to be enabled to avoid spurious firing
    uint32_t new_interrupts = mask & (~old_mask);
    Cy_I2S_ClearInterrupt(obj->base, new_interrupts);

    Cy_I2S_SetInterruptMask(obj->base, mask);
#elif defined(CY_IP_MXTDM)
    uint32_t tx_mask = obj->interface->convert_to_pdl(events, true);
    uint32_t old_tx_mask = Cy_AudioTDM_GetTxInterruptMask(&obj->base->TDM_TX_STRUCT);

    // Clear the interrupts that are about to be enabled to avoid spurious firing
    uint32_t new_interrupts_tx = tx_mask & (~old_tx_mask);
    Cy_AudioTDM_ClearTxInterrupt(&obj->base->TDM_TX_STRUCT, new_interrupts_tx);
    Cy_AudioTDM_SetTxInterruptMask(&obj->base->TDM_TX_STRUCT, tx_mask);

    uint32_t rx_mask = obj->interface->convert_to_pdl(events, false);
    uint32_t old_rx_mask = Cy_AudioTDM_GetRxInterruptMask(&obj->base->TDM_RX_STRUCT);

    // Clear the interrupts that are about to be enabled to avoid spurious firing
    uint32_t new_interrupts_rx = rx_mask & (~old_rx_mask);
    Cy_AudioTDM_ClearRxInterrupt(&obj->base->TDM_RX_STRUCT, new_interrupts_rx);
    Cy_AudioTDM_SetRxInterruptMask(&obj->base->TDM_RX_STRUCT, rx_mask);
#endif
}

#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
static void _cyhal_audioss_update_rx_trigger_level(_cyhal_audioss_t *obj)
{
    // If we're doing an async read and the amount remaining is less than
    // the standard trigger level, temporarily reduce it so that we get
    // an interrupt as soon as the amount the user requested is ready
    uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
    uint8_t trigger_level = obj->user_fifo_level_rx;
    if(NULL != obj->async_rx_buff
       && obj->async_rx_length < trigger_level
       && obj->async_rx_length > 0)
    {
        trigger_level = obj->async_rx_length;
    }

#if defined(CY_IP_MXAUDIOSS)
    // Safe to do a blind write of this register because the only other bits are
    // CLEAR, which is only set temporarily from clear_tx, and FREEZE, which is
    // never used by this driver (it exists for debugging purposes only)
    obj->base->RX_FIFO_CTL = (uint32_t) (trigger_level << I2S_RX_FIFO_CTL_TRIGGER_LEVEL_Pos);
#elif defined(CY_IP_MXTDM)
    uint32_t value = obj->base->TDM_RX_STRUCT.RX_FIFO_CTL;
    value &= ~TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_TRIGGER_LEVEL_Msk;
    value |= trigger_level << TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_TRIGGER_LEVEL_Pos;
    obj->base->TDM_RX_STRUCT.RX_FIFO_CTL = value;
#endif
    cyhal_system_critical_section_exit(savedIntrStatus);
}
#endif

static uint32_t _cyhal_audioss_disable_events(_cyhal_audioss_t *obj, bool tx)
{
#if defined(CY_IP_MXAUDIOSS)
    CY_UNUSED_PARAMETER(tx);
    uint32_t old_interrupt_mask = Cy_I2S_GetInterruptMask(obj->base);
    Cy_I2S_SetInterruptMask(obj->base, 0u);
    return old_interrupt_mask;
#elif defined(CY_IP_MXTDM)
    uint32_t old_interrupt_mask;
    if(tx)
    {
        old_interrupt_mask = Cy_AudioTDM_GetTxInterruptMask(&obj->base->TDM_TX_STRUCT);
        Cy_AudioTDM_SetTxInterruptMask(&obj->base->TDM_TX_STRUCT, 0u);
    }
    else
    {
        old_interrupt_mask = Cy_AudioTDM_GetRxInterruptMask(&obj->base->TDM_RX_STRUCT);
        Cy_AudioTDM_SetRxInterruptMask(&obj->base->TDM_RX_STRUCT, 0u);
    }
    return old_interrupt_mask;
#endif
}

static void _cyhal_audioss_restore_events(_cyhal_audioss_t *obj, bool tx, uint32_t old_events)
{
#if defined(CY_IP_MXAUDIOSS)
    CY_UNUSED_PARAMETER(tx);
    Cy_I2S_SetInterruptMask(obj->base, old_events);
#elif defined(CY_IP_MXTDM)
    if(tx)
    {
        Cy_AudioTDM_SetTxInterruptMask(&obj->base->TDM_TX_STRUCT, old_events);
    }
    else
    {
        Cy_AudioTDM_SetRxInterruptMask(&obj->base->TDM_RX_STRUCT, old_events);
    }
#endif
}

#if defined(_CYHAL_AUDIOSS_RX_ENABLED)
static cy_rslt_t _cyhal_audioss_dma_perform_rx(_cyhal_audioss_t *obj)
{
    // We could have received an event after we started the DMA but before it
    // managed to bring the FIFO below the threshold
    if(cyhal_dma_is_busy(&(obj->rx_dma)))
        return CY_RSLT_SUCCESS;
    /* ISR triggers when we have one more entry in the FIFO than the trigger level */
    size_t transfer_size = _cyhal_audioss_fifo_trigger_level(obj, false) + 1;
    if (transfer_size >= obj->async_rx_length)
    {
        transfer_size = obj->async_rx_length;
        // Only want the user callback to be call on the last dma transfer.
        cyhal_dma_enable_event(&(obj->rx_dma), CYHAL_DMA_TRANSFER_COMPLETE, obj->async_dma_priority, true);
    }

    cyhal_dma_cfg_t dma_cfg =
    {
#if defined(CY_IP_MXAUDIOSS)
        .src_addr = (uint32_t)(&(obj->base->RX_FIFO_RD)),
#elif defined(CY_IP_MXTDM)
        .src_addr = (uint32_t)(&(obj->base->TDM_RX_STRUCT.RX_FIFO_RD)),
#endif
        .src_increment = 0,
        .dst_addr = (uint32_t)obj->async_rx_buff,
        .dst_increment = 1,
        .transfer_width = _cyhal_audioss_rounded_word_length(obj, false),
        .length = transfer_size,
        .burst_size = 0,
        .action = CYHAL_DMA_TRANSFER_FULL,
    };
    cy_rslt_t result = cyhal_dma_configure(&(obj->rx_dma), &dma_cfg);

    if(CY_RSLT_SUCCESS == result)
    {
        result = cyhal_dma_enable(&(obj->rx_dma));
    }

    // Update the buffer first so that it's guaranteed to be correct whenever the DMA completes
    if(CY_RSLT_SUCCESS == result)
    {
        size_t increment_bytes = transfer_size * (_cyhal_audioss_rounded_word_length(obj, false) / 8);
        uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
        obj->async_rx_buff = (void*)(((uint8_t*) obj->async_rx_buff) + increment_bytes);
        obj->async_rx_length -= transfer_size;
        _cyhal_audioss_update_rx_trigger_level(obj);
        _cyhal_audioss_update_enabled_events(obj);
        cyhal_system_critical_section_exit(savedIntrStatus);

